Revit 2022 API
StructuralSettings.AnalyticalModelVerticalAutofixTolerance Property
 Tolerance for vertical auto-detect for the analytical model.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2011
Syntax
C#
public double AnalyticalModelVerticalAutofixTolerance { get; set; }
Visual Basic
Public Property AnalyticalModelVerticalAutofixTolerance As Double
	Get
	Set
Visual C++
public:
property double AnalyticalModelVerticalAutofixTolerance {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace